# Домашнее задание № 1 
'''
1. Создайте словарь "саr" с ключами "марка", "модель" и "год". Присвойте
значения соответствующим ключам.
'''

car = {
    "марка": "Lada",
    "модель": "2107",
    "год": 2008
}

'''
2. Добавьте в словарь "саг" новый ключ-значение "цвет" со значением
"черный".
'''

car["цвет"] = "черный"


'''
3. Выведите значение ключа "марка" из словаря "car".
'''

print(car["марка"])


'''
4. Создайте список "fruits" и добавьте в него названия нескольких фруктов.
'''

fruits = ["яблоко", "банан", "апельсин", "груша"]


'''
5. Выведите на экран первый элемент из списка "fruits".
'''

print(fruits[0])

'''
6. Создайте кортеж "numbers" и запишите в него несколько чисел.
'''

numbers = (1, 2, 3, 4, 5)

'''
7. Выведите на экран последний элемент из кортежа "numbers".
'''

print(numbers[-1])

#----------------------------------------------------------

# Итоговый код:

# 1. Создание словаря "car"
car = {
    "марка": "Lada",
    "модель": "2107",
    "год": 2008
}

# 2. Добавление нового ключа-значения "цвет"
car["цвет"] = "черный"

# 3. Вывод значения ключа "марка"
print(car["марка"])

# 4. Создание списка "fruits"
fruits = ["яблоко", "банан", "апельсин", "груша"]

# 5. Вывод первого элемента из списка "fruits"
print(fruits[0])

# 6. Создание кортежа "numbers"
numbers = (1, 2, 3, 4, 5)

# 7. Вывод последнего элемента из кортежа "numbers"
print(numbers[-1])
